src/views/guia-linux/linux-configuracion-de-red.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-04 dom 01:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guia Linux - Configuración de Red</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="jelou" />
<link rel="stylesheet" type="text/css" href="/assets/css/style.css"/>
<link rel="stylesheet" type="text/css" href="/assets/css/sass-style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Guia Linux - Configuración de Red</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3f9078d">1. Proxy (Squid) y Firewall (Ufw)</a>
<ul>
<li><a href="#orgc0e1d42">1.1. Comandos básicos</a></li>
<li><a href="#orgd778462">1.2. Referencias</a></li>
</ul>
</li>
<li><a href="#org7d2e219">2. Configuración de red</a>
<ul>
<li><a href="#org6edef40">2.1. Conceptos</a></li>
<li><a href="#org94c4bc2">2.2. Comandos básicos</a>
<ul>
<li><a href="#org9553bd7">2.2.1. Listar interfaces de red</a></li>
<li><a href="#org2d41f56">2.2.2. Mostrar IP de las interfaces</a></li>
<li><a href="#orgdae15ef">2.2.3. Mostrar tablas de enrutamiento</a></li>
<li><a href="#org2fd18d0">2.2.4. Otros comandos</a></li>
</ul>
</li>
<li><a href="#orgde27408">2.3. Referencias</a>
<ul>
<li><a href="#org9bc3f9a">2.3.1. Referencias Web Oficiales</a></li>
<li><a href="#orgeca8323">2.3.2. Referencias Web Extraoficiales</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5bba8ae">3. Configurar Proxy</a>
<ul>
<li><a href="#orge2951b1">3.1. Configuración</a></li>
<li><a href="#orgc1f2b19">3.2. Configurar Navegador Web</a></li>
<li><a href="#org9a15f19">3.3. Mostrar Errores de Squid</a></li>
<li><a href="#org989e832">3.4. Referencias Web</a></li>
</ul>
</li>
<li><a href="#org9f1d133">4. Iptables</a>
<ul>
<li><a href="#org9ea6e64">4.1. Referencias Youtube</a></li>
</ul>
</li>
<li><a href="#orge99e257">5. Proxy Squid y Tor</a>
<ul>
<li><a href="#orgd556d5d">5.1. Referencias Youtube</a></li>
</ul>
</li>
<li><a href="#org726abb3">6. Referencias</a>
<ul>
<li><a href="#orgcb2eb28">6.1. Referencias Web Oficiales</a></li>
<li><a href="#org455e6fc">6.2. Referencias Web Extraoficiales</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<b>Aviso:</b>
Por el momento no pude documentar por completo documentacion de este tipo
pero debajo dejo algunas referencias importantes para entrar en tema.
</p>

<div id="outline-container-org3f9078d" class="outline-2">
<h2 id="org3f9078d"><span class="section-number-2">1</span> Proxy (Squid) y Firewall (Ufw)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc0e1d42" class="outline-3">
<h3 id="orgc0e1d42"><span class="section-number-3">1.1</span> Comandos básicos</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Comandos utilizados en la distribución <b><b>ArchLinux</b></b> puede llegar a diferir según cual tengan instalado.
</p>

<ol class="org-ol">
<li>Para iniciar el servicio usar <code>sudo systemctl start squid</code></li>
<li>Para saber el estado <code>sudo systemctl status squid</code></li>
<li>Reiniciar <code>sudo systemctl restart squid</code></li>
<li>Revisar si no hay errores <code>sudo squid -k check</code></li>
</ol>
</div>
</div>
<div id="outline-container-orgd778462" class="outline-3">
<h3 id="orgd778462"><span class="section-number-3">1.2</span> Referencias</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Página Oficial de Squid [Ver Página](<a href="http://www.squid-cache.org">http://www.squid-cache.org</a>)</li>
<li>Configurar Squid en Ubuntu - Ajpsoft [Ver Página](<a href="https://www.ajpdsoft.com/modules.php?name=News&amp;file=article&amp;sid=441">https://www.ajpdsoft.com/modules.php?name=News&amp;file=article&amp;sid=441</a>)</li>
<li>Conceptos de Proxy con Squid - Educacion ITE [Ver Página](<a href="http://www.ite.educacion.es/formacion/materiales/85/cd/linux/m6/proxy_squid.html">http://www.ite.educacion.es/formacion/materiales/85/cd/linux/m6/proxy_squid.html</a>)</li>
<li>Configurar Squid en Ubuntu - Kacharreando [Ver Página](<a href="http://www.kacharreando.com/ubuntu/configurar-proxy-squid/">http://www.kacharreando.com/ubuntu/configurar-proxy-squid/</a>)</li>
<li>Que es Squid - Wiki [Ver Página](<a href="https://es.wikipedia.org/wiki/Squid_(programa)">https://es.wikipedia.org/wiki/Squid_(programa)</a>)</li>
<li>Configurar Servicios Linux con Proxy [Ver Página](<a href="https://www.sysadminsdecuba.com/2017/11/tips-configuracion-de-proxy-para-los-servicios-de-linux/">https://www.sysadminsdecuba.com/2017/11/tips-configuracion-de-proxy-para-los-servicios-de-linux/</a>)</li>
<li>[Manual de Configuración](<a href="https://www.pks.mpg.de/~mueller/docs/suse10.2/html/opensuse-manual_en/manual/sec.squid.configfile.html">https://www.pks.mpg.de/~mueller/docs/suse10.2/html/opensuse-manual_en/manual/sec.squid.configfile.html</a>)</li>
<li>[Breve introducción a Squid Server](<a href="https://doxfer.webmin.com/Webmin/Squid_Proxy_Server">https://doxfer.webmin.com/Webmin/Squid_Proxy_Server</a>)</li>
<li><a href="https://esgeeks.com/abrir-cerrar-puertos-linux/">Abrir y cerrar puertos - esgeeks.com</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7d2e219" class="outline-2">
<h2 id="org7d2e219"><span class="section-number-2">2</span> Configuración de red</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6edef40" class="outline-3">
<h3 id="org6edef40"><span class="section-number-3">2.1</span> Conceptos</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Podemos identificar las interfaces de red de la siguiente forma: 
</p>
<ul class="org-ul">
<li><b>Adaptadores Ethernet:</b> eth0, eth1, eth2, eth3, &#x2026;</li>
<li><b>Adaptadores Inalambricos:</b> wlan0, wlan1, wlan2, wlan3, &#x2026;</li>
<li><b>Adaptador de LoopBack:</b> lo</li>
</ul>

<p>
<b>Nota:</b>
El adaptador o interfaz de loopback es un adaptador virtual de la misma maquina y 
se accede de a traves de la direccion 127.0.0.1 o del nombre de dominio localhost
</p>
</div>
</div>
<div id="outline-container-org94c4bc2" class="outline-3">
<h3 id="org94c4bc2"><span class="section-number-3">2.2</span> Comandos básicos</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Según la distribución de Linux los comandos pueden variar, estos se hacen en ArchLinux
</p>
</div>

<div id="outline-container-org9553bd7" class="outline-4">
<h4 id="org9553bd7"><span class="section-number-4">2.2.1</span> Listar interfaces de red</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-shell" id="orgf2a5ff4"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">listar interfaces</span>
ip link
</pre>
</div>
</div>
</div>
<div id="outline-container-org2d41f56" class="outline-4">
<h4 id="org2d41f56"><span class="section-number-4">2.2.2</span> Mostrar IP de las interfaces</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-shell" id="org07d8151">ip address show
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdae15ef" class="outline-4">
<h4 id="orgdae15ef"><span class="section-number-4">2.2.3</span> Mostrar tablas de enrutamiento</h4>
<div class="outline-text-4" id="text-2-2-3">
</div>
<ol class="org-ol">
<li><a id="orge44347d"></a>Procedimiento<br />
<div class="outline-text-5" id="text-2-2-3-1">
<div class="org-src-container">
<pre class="src src-shell" id="orgf5ea7ad">ip route show
</pre>
</div>
</div>
</li>
<li><a id="org21e1202"></a>Referencias Extraoficiales<br />
<div class="outline-text-5" id="text-2-2-3-2">
<ul class="org-ul">
<li><a href="https://www.sololinux.es/uso-del-comando-route-en-linux/">https://www.sololinux.es/uso-del-comando-route-en-linux/</a></li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org2fd18d0" class="outline-4">
<h4 id="org2fd18d0"><span class="section-number-4">2.2.4</span> Otros comandos</h4>
<div class="outline-text-4" id="text-2-2-4">
<div class="org-src-container">
<pre class="src src-shell" id="org0c61ee7"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para ver las conexiones</span>
nmcli

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">editar conexiones via terminal</span>
nmtui

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">gui de conexiones</span>
nm-connection-editor
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgde27408" class="outline-3">
<h3 id="orgde27408"><span class="section-number-3">2.3</span> Referencias</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org9bc3f9a" class="outline-4">
<h4 id="org9bc3f9a"><span class="section-number-4">2.3.1</span> Referencias Web Oficiales</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li>Documentación Oficial de Redes -TLDP [Ver Página](<a href="http://www.tldp.org/LDP/nag2/">http://www.tldp.org/LDP/nag2/</a>)</li>
<li>Configuración de red - Wiki Arch [Ver Página](<a href="https://wiki.archlinux.org/index.php/Network_configuration">https://wiki.archlinux.org/index.php/Network_configuration</a>)</li>
</ul>
</div>
</div>
<div id="outline-container-orgeca8323" class="outline-4">
<h4 id="orgeca8323"><span class="section-number-4">2.3.2</span> Referencias Web Extraoficiales</h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li><a href="https://www.redeszone.net/tutoriales/servidores/configurar-linux-comando-ip-iproute2-suite/">https://www.redeszone.net/tutoriales/servidores/configurar-linux-comando-ip-iproute2-suite/</a></li>
<li><a href="https://www.ibiblio.org/pub/Linux/docs/LuCaS/Presentaciones/200103hispalinux/eric/html/rutas.html">https://www.ibiblio.org/pub/Linux/docs/LuCaS/Presentaciones/200103hispalinux/eric/html/rutas.html</a></li>
<li>Como usar NetworkManager [Ver Página](<a href="https://linuxhint.com/arch_linux_network_manager/">https://linuxhint.com/arch_linux_network_manager/</a>)</li>
<li>Configurar Red - CetemRedes [Ver Página](<a href="http://cetemredes2.blogspot.com/2014/04/configurar-adaptador-de-red.html">http://cetemredes2.blogspot.com/2014/04/configurar-adaptador-de-red.html</a>)</li>
<li>Configurar Red en Ubuntu - Danjared [Ver Página](<a href="https://danjared.wordpress.com/2011/03/09/configurar-el-proxy-en-ubuntu/">https://danjared.wordpress.com/2011/03/09/configurar-el-proxy-en-ubuntu/</a>)</li>
<li>Configurar Proxy con Tor [Ver Página](<a href="https://securityhacklabs.net/articulo/enrutando-todo-tu-trafico-bajo-la-red-tor-como-un-proxy-transparente-en-linux">https://securityhacklabs.net/articulo/enrutando-todo-tu-trafico-bajo-la-red-tor-como-un-proxy-transparente-en-linux</a>)</li>
<li>Conceptos de Redes [Ver Página](<a href="http://www.nexolinux.com/configurar-red-en-linux/">http://www.nexolinux.com/configurar-red-en-linux/</a>)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org5bba8ae" class="outline-2">
<h2 id="org5bba8ae"><span class="section-number-2">3</span> Configurar Proxy</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge2951b1" class="outline-3">
<h3 id="orge2951b1"><span class="section-number-3">3.1</span> Configuración</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Abrir el archivo de configuración <b>enviroment</b> con <code>sudo nano /etc/environment</code></li>
<li><p>
Agregar la siguiente configuración
</p>
<div class="org-src-container">
<pre class="src src-bash" id="org46c9b8d"><span style="color: #7590db;">http_proxy</span>=<span style="color: #2d9574;">"http://192.168.1.89:3128/"</span>
<span style="color: #7590db;">https_proxy</span>=<span style="color: #2d9574;">"https://192.168.1.89:3128/"</span>
<span style="color: #7590db;">no_proxy</span>=<span style="color: #2d9574;">"localhost,127.0.0.1,::1</span>
</pre>
</div></li>

<li>Para verificar que se aplicaron los cambios verificamos las <b>variables globales</b> con <code>env | grep proxy</code></li>
</ol>

<p>
<b>Observación:</b>
El puerto 3128 es el predeterminado por squid, esta modificación solo afecta a la sesión abierta
</p>
</div>
</div>
<div id="outline-container-orgc1f2b19" class="outline-3">
<h3 id="orgc1f2b19"><span class="section-number-3">3.2</span> Configurar Navegador Web</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Cada navegador puede tomar diferente los proxy, en este caso mostraremos con Opera
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgc817bfb">opera --proxy-server=<span style="color: #2d9574;">"http://192.168.1.89.3128/"</span>
</pre>
</div>

<p>
<b>Observación:</b>
Para más información ingresar lo siguiente en la barra de direcciones `opera://linux-proxy-config`
</p>
</div>
</div>
<div id="outline-container-org9a15f19" class="outline-3">
<h3 id="org9a15f19"><span class="section-number-3">3.3</span> Mostrar Errores de Squid</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Para ver los errores de squid antes de correr del servicio 
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org18e78f6">sudo squid -k check

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">lanza error si hay algo mal configurado</span>
sudo squid -k reconfigure
</pre>
</div>
</div>
</div>
<div id="outline-container-org989e832" class="outline-3">
<h3 id="org989e832"><span class="section-number-3">3.4</span> Referencias Web</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>[Configurar Proxy en la Shell ZSH](<a href="https://ketansingh.net/setting-proxy-for-archlinux/">https://ketansingh.net/setting-proxy-for-archlinux/</a></li>
<li>Configurar en Ubuntu [Ver Video](<a href="https://www.youtube.com/watch?v=6qLRHDXPda8">https://www.youtube.com/watch?v=6qLRHDXPda8</a>)</li>
<li>[Configurar Proxy - Garron](<a href="https://www.garron.me/es/gnu-linux/configurar-proxy-ubuntu-desktop-server.html">https://www.garron.me/es/gnu-linux/configurar-proxy-ubuntu-desktop-server.html</a>)</li>
<li>[Configurar en Ubuntu](<a href="https://www.sololinux.es/instalar-squid-proxy-server-en-ubuntu-18-04/">https://www.sololinux.es/instalar-squid-proxy-server-en-ubuntu-18-04/</a>)</li>
<li>[Configurar Enviroment](<a href="https://medium.com/@krish.raghuram/setting-up-proxy-in-ubuntu-95058da0b2d4">https://medium.com/@krish.raghuram/setting-up-proxy-in-ubuntu-95058da0b2d4</a>)</li>
<li>[User Agent](<a href="http://www.user-agents.org">http://www.user-agents.org</a>)</li>
<li>[Conocer user agente](<a href="https://www.whoishostingthis.com/tools/user-agent/">https://www.whoishostingthis.com/tools/user-agent/</a>)</li>
<li>[Block a Browser in Squid](<a href="https://www.linuxquestions.org/questions/linux-server-73/block-a-browser-in-squid-924596/">https://www.linuxquestions.org/questions/linux-server-73/block-a-browser-in-squid-924596/</a>)</li>
<li>[Instalar Squid Proxy Server en Ubuntu](<a href="https://www.sololinux.es/instalar-squid-proxy-server-en-ubuntu-18-04/">https://www.sololinux.es/instalar-squid-proxy-server-en-ubuntu-18-04/</a>)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9f1d133" class="outline-2">
<h2 id="org9f1d133"><span class="section-number-2">4</span> Iptables</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9ea6e64" class="outline-3">
<h3 id="org9ea6e64"><span class="section-number-3">4.1</span> Referencias Youtube</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>[Referencia #1 - Youtube ](<a href="https://www.youtube.com/watch?v=Yk61s5Ec6YA">https://www.youtube.com/watch?v=Yk61s5Ec6YA</a>)</li>
<li>[Referencia #2 - YOutube](<a href="https://www.youtube.com/watch?v=qPEA6J9pjG8">https://www.youtube.com/watch?v=qPEA6J9pjG8</a>)</li>
<li>[Referencia #3 - youtube](<a href="https://www.youtube.com/watch?v=zELPIdxoGaQ&amp;t=93s">https://www.youtube.com/watch?v=zELPIdxoGaQ&amp;t=93s</a>)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge99e257" class="outline-2">
<h2 id="orge99e257"><span class="section-number-2">5</span> Proxy Squid y Tor</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd556d5d" class="outline-3">
<h3 id="orgd556d5d"><span class="section-number-3">5.1</span> Referencias Youtube</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=vj00RVHGxFg">https://www.youtube.com/watch?v=vj00RVHGxFg</a></li>
<li><a href="https://www.youtube.com/watch?v=IJ-1Dksex5k">https://www.youtube.com/watch?v=IJ-1Dksex5k</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org726abb3" class="outline-2">
<h2 id="org726abb3"><span class="section-number-2">6</span> Referencias</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgcb2eb28" class="outline-3">
<h3 id="orgcb2eb28"><span class="section-number-3">6.1</span> Referencias Web Oficiales</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>[Comando ifconfig, The Linux Documentation Project](<a href="http://es.tldp.org/Manuales-LuCAS/GARL2/garl2/x-087-2-iface.ifconfig.html">http://es.tldp.org/Manuales-LuCAS/GARL2/garl2/x-087-2-iface.ifconfig.html</a>)</li>
<li>[Curso de Redes](<a href="http://e-ghost.deusto.es/docs/articulo.redes.html">http://e-ghost.deusto.es/docs/articulo.redes.html</a>)</li>
<li>[Curso de Administracion de Sistemas y Redes](<a href="http://persoal.citius.usc.es/tf.pena/ASR/Tema_3html/node21.html">http://persoal.citius.usc.es/tf.pena/ASR/Tema_3html/node21.html</a>)</li>
</ul>
</div>
</div>
<div id="outline-container-org455e6fc" class="outline-3">
<h3 id="org455e6fc"><span class="section-number-3">6.2</span> Referencias Web Extraoficiales</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>[Configurar Interfaces, LinuxConfig](<a href="https://linuxconfig.org/configuring-virtual-network-interfaces-in-linux">https://linuxconfig.org/configuring-virtual-network-interfaces-in-linux</a>)</li>
<li>[Configurar manual ip permanente/temporal, Meltit](<a href="http://www.meltit.com.ar/linux-configuracion-internetip-manual-permanente-y-temporal-route-nameserver-interf">http://www.meltit.com.ar/linux-configuracion-internetip-manual-permanente-y-temporal-route-nameserver-interf</a></li>
</ul>
<p>
aces-ifconfig-gateway)
</p>
<ul class="org-ul">
<li>[Configuracion de la Interfaz - IngDiaz](<a href="http://www.ingdiaz.org/configuracion-de-interfaces-de-red-en-ubuntu-distros-basados-en-debian/">http://www.ingdiaz.org/configuracion-de-interfaces-de-red-en-ubuntu-distros-basados-en-debian/</a>)</li>
<li>[Comando ip y ifconfig, Linux Party](<a href="https://www.linux-party.com/29-internet/10036-ifconfig-vs-ip-diferencia-y-comparacion-de-la-configuracion-de-red">https://www.linux-party.com/29-internet/10036-ifconfig-vs-ip-diferencia-y-comparacion-de-la-configuracion-de-red</a>)</li>
<li>[Comando ifconfig con ejemplos, Mas Linux](<a href="https://maslinux.es/comando-ifconfig-aprende-con-algunos-ejemplos/">https://maslinux.es/comando-ifconfig-aprende-con-algunos-ejemplos/</a>)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jelou</p>
<p class="date">Created: 2021-04-04 dom 01:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
